[
    {
        "model": "app.Usuario",
        "pk": 1,
        "fields": {
            "nickname" : "grupo7",
            "password" : "grupo7"
        }
    },
    {
        "model": "app.Isla",
        "pk": 1,
        "fields": {
            "nombre": "ISABELA",
            "calificacion_uno": 1,
            "calificacion_dos": 1,
            "calificacion_tres": 50,
            "descripcion": "Albemarle en inglés.;Isla más grande 4588 km2.; 2.344 habitantes (2015).;Punto más alto: volcán Wolf 1.707 m. ;Animales: Tortugas gigantes, pingüinos, cormoranes, iguanas marinas, iguanas terrestres, lobos marinos, pelícanos, cangrejos rojos, pinzones, flamencos, halcones y palomas.;Puntos de interés: muro de las lágrimas, laguna flamingo, Tagus Cove, Bahía Urbina, Punta Vicente Roca, Bahía Elizabeth, Las Tintoreras; Activitades: caminatas, paseos en bote, observación de aves, observación de tortugas, buceo/snorkel;Ciudad principal: Puerto Villamil.",
            "imagen":
                "https://i0.wp.com/ecuadorgalapagosinfo.com/wp-content/uploads/2023/04/los-tuneles-isabela278091723.jpeg?w=800&ssl=1"

        }
    },
    {
        "model": "app.Isla",
        "pk": 2,
        "fields": {
            "nombre": "SANTA CRUZ",
            "calificacion_tres" : 1,
            "calificacion_dos" : 3,
            "calificacion_uno" : 6,
            "descripcion" : "Indefatigable en inglés.; 986 km2, segunda isla más grande de Galápagos;15701 habitantes.;Punto más alto 864 m (Cerro Crocker).; Animales: Iguanas, Tiburones de arrecife de punta blanca, tortugas gigantes de Galápagos, lobos marinos, Piquero de patas azules, Garza azulada, fragata común, cucuve, cangrejo violinista.; Lugares de interés: Bahia Tortuga, Canal de Itabaca, Estación científica Charles Darwin, túneles de lava, las grietas, Caleta Tortuga Negra, Cerro Dragón.",
            "imagen" : "https://i0.wp.com/ecuadorgalapagosinfo.com/wp-content/uploads/2019/02/tortugas-estacion-charles-darwin.jpg?w=800&ssl=1"
        }
    },
    {
        "model": "app.Isla",
        "pk": 3,
        "fields": {
            "nombre": "FERNANDINA",
            "calificacion_tres" : 100,
            "calificacion_dos" : 6,
            "calificacion_uno" : 1,
            "descripcion" : "Narborough en inglés.; Tercer isla más grande, superficie de 642 km2.;0 habitantes; 1494 m punto más alto: La Cumbre.;Animales: Pingüinos, lobos marinos, cormoranes, pelícanos, iguanas marinas, iguanas terrestres.;Lugares de interés: Punta Espinoza.",
            "imagen" : "https://i0.wp.com/ecuadorgalapagosinfo.com/wp-content/uploads/2019/03/lobos-marinos-iguanas.jpg?w=800&ssl=1"
        }
    },
    {
        "model": "app.Isla",
        "pk": 4,
        "fields": {
            "nombre": "SANTIAGO",
            "calificacion_tres" : 1,
            "calificacion_dos" : 2,
            "calificacion_uno" : 1,
            "descripcion" : "James Island en inglés.;Superficie: 585 km2.; 172 habitantes;Punto más alto: 907m.;Animales: Tortugas gigantes, iguanas marinas, lobos marinos, focas peleteras, tortugas terrestres, tortugas marinas, flamencos, delfines, tiburones.;Puntos de Interés: Bahía James, Bahía Sullivan, Cousins Rock, Puerto Egas.",
            "imagen" : "https://i0.wp.com/ecuadorgalapagosinfo.com/wp-content/uploads/2023/05/puerto-egas.jpeg?w=800&ssl=1"
        }
    },
    {
        "model": "app.Isla",
        "pk": 5,
        "fields": {
            "nombre": "SAN CRISTOBAL",
            "calificacion_tres" : 2,
            "calificacion_dos" : 1,
            "calificacion_uno" : 5,
            "descripcion" : "Chatman en inglés.;Superficie: 558 km2.;5.600 habitantes.;Punto más alto: 730m.;Animales: fragatas, lobos marinos, tortugas gigantes, iguanas marinas, delfines, alcatraces patirrojos, alcatraces patas azules.;Puntos de interés: Laguna El Junco, La Galapaguera, La Lobería (colonia de lobos marinos), Cerro Tijeretas, Estación Biológica San Cristóbal, estatua de Charles Darwin, Leon Dormido (Kickers Rock), Isla Lobos, Cerro Brujo, Cerro Colorado.",
            "imagen" : "https://i0.wp.com/ecuadorgalapagosinfo.com/wp-content/uploads/2020/01/leon-dormido-2.jpg?w=800&ssl=1"
        }
    },
    {
        "model": "app.Isla",
        "pk": 6,
        "fields": {
            "nombre": "SANTA FE",
            "calificacion_tres" : 5,
            "calificacion_dos" : 2,
            "calificacion_uno" : 10,
            "descripcion" : "Barrington en inglés .;Superficie: 24 km2.; 0 habitantes.;Altitud máxima: 259 m.;Animales: Iguana terrestre, lagartija de lava, lobos marinos, petreles, gaviotas.;Puntos de interés: bosques de cactus gigantes.",
            "imagen" : "https://i0.wp.com/ecuadorgalapagosinfo.com/wp-content/uploads/2019/07/iguana-marina-santa-fe.jpg?w=800&ssl=1"
        }
    },
    {
        "model": "app.Isla",
        "pk": 7,
        "fields": {
            "nombre": "FLOREANA",
            "calificacion_tres" : 1,
            "calificacion_dos" : 5,
            "calificacion_uno" : 1,
            "descripcion" : "Charles Island en inglés.;Superficie: 173 km2.;188 habitantes.;Punto más alto: Cerro Pajas (640m).; Animales: Pingüinos, Flamencos rosados, Tortugas marinas.; Puntos de interés: Bahía de Correos (barril de correo), Corona del Diablo, Cormorant Point, Islote Campéon (para snorkel)",
            "imagen" : "https://i0.wp.com/ecuadorgalapagosinfo.com/wp-content/uploads/2019/07/piquero-patas-azules.jpg?w=800&ssl=1"
        }
    },
    {
        "model": "app.Comentario",
        "pk": 1,
        "fields": {
            "comentario" : "Hay tortugas muy bonitas en la isla San Cristobal",
            "fecha" : "2024-06-01",
            "hora" : "21:00",
            "usuario" : 1
        }
    },
    {
        "model": "app.Comentario",
        "pk": 2,
        "fields": {
            "comentario" : "Hay iguanas muy bonitas en la isla Isabela",
            "fecha" : "2024-06-01",
            "hora" : "14:00",
            "usuario" : 1
        }
    },
    {
        "model": "app.Actividad",
        "pk": 1,
        "fields": {
            "nombre" : "Paseo en bote",
            "direccion" : "Isla Isabela",
            "hora_inicio" : "9:30",
            "hora_fin" : "21:00",
            "edad" : 21,
            "precio" : 20.85,
            "isla" : 1,
            "imagen" : "https://latintrails.com/wp-content/uploads/2018/08/galapagos-adventure-latin-trails1.jpg"
        }
    },
    {
        "model": "app.Actividad",
        "pk": 2,
        "fields": {
            "nombre" : "Senderismo",
            "direccion" : "Isla San Cristobal",
            "hora_inicio" : "9:30",
            "hora_fin" : "15:30",
            "edad" : 25,
            "precio" : 5.50,
            "isla" : 5,
            "imagen": "https://naturegalapagos.com/es/wp-content/uploads/sites/3/2018/12/que-hacer-en-isla-isabela-galapagos-feat.jpg"
        }
    },
    {
        "model":"app.GuiasTuristicos",
        "pk": 1,
        "fields": {
            "nombre" : "Guia 01",
            "edad" : 25,
            "telefono" : "0987654321",
            "imagen" : "https://static.vecteezy.com/system/resources/previews/014/288/076/non_2x/tourist-city-guide-with-flag-icon-cartoon-style-vector.jpg",
            "isla" : 1
        }
    },
    {
        "model": "app.Negocio",
        "pk": 1,
        "fields": {
            "nombre" : "Negocio 01",
            "servicios" : "Comida rica, cocteles",
            "hora_inicio" : "9:30",
            "hora_fin" : "21:00",
            "direccion" : "Direccion cerca de aqui",
            "imagen" : "https://www.lavanguardia.com/files/image_990_484/files/fp/uploads/2021/12/23/61c456cc62a0b.r_d.2520-1680.jpeg",
            "tipo_negocio" : 1,
            "isla" : 1
        }
    },
    {
        "model": "app.Negocio",
        "pk": 2,
        "fields": {
            "nombre" : "Negocio 02",
            "servicios" : "Comida rica, bebidas bien sabrosas",
            "hora_inicio" : "9:30",
            "hora_fin" : "21:00",
            "direccion" : "Direccion cerca de alla",
            "imagen" : "https://aureoarquitectura.com/wp-content/uploads/2023/09/Diseno-interior-restaurant.webp",
            "tipo_negocio" : 1,
            "isla" : 2
        }
    },
    {
        "model": "app.TipoNegocio",
        "pk": 1,
        "fields": {
            "tipo" : "RESTAURANTE"
        }
    },
    {
        "model": "app.TipoNegocio",
        "pk": 2,
        "fields": {
            "tipo" : "HOTEL"
        }
    },
    {
        "model": "app.TipoNegocio",
        "pk": 3,
        "fields": {
            "tipo" : "TIENDA DE RECUERDOS"
        }
    },
    {
        "model": "app.Resena",
        "pk": 1,
        "fields": {
            "descripcion" : "Esto es una resena",
            "fecha" : "2024-01-01",
            "hora" : "9:00",
            "negocio" : 1,
            "usuario" : 1
        }
    },
    {
        "model": "app.Resena",
        "pk": 2,
        "fields": {
            "descripcion" : "Esto es una resena 2",
            "fecha" : "2024-02-02",
            "hora" : "10:00",
            "negocio" : 1,
            "usuario" : 1
        }
    },
    {
        "model": "app.Biodiversidad",
        "pk": 1,
        "fields": {
            "nombre_comun" : "Tortuga de Galapagos",
            "nombre_cientifico" : "xxxxxxxxx",
            "dato" : "Pueden vivir mucho",
            "imagen" : "https://content.nationalgeographic.com.es/medio/2024/02/05/tortuga-gigante-galapagos_2a766ad7_240205124113_800x533.jpg"
        }
    },
    {
        "model": "app.Biodiversidad",
        "pk": 2,
        "fields": {
            "nombre_comun" : "Iguana de Galapagos",
            "nombre_cientifico" : "xxxxxxx",
            "dato" : "Se adaptan bien",
            "imagen" : "https://www.metropolitan-touring.com/wp-content/uploads/2022/09/1_galapagos-marine-iguana.jpg"
        }
    },
    {
        "model": "app.Biodiversidad",
        "pk": 3,
        "fields": {
            "nombre_comun" : "Cactus de Galapagos",
            "nombre_cientifico" : "xxxxxxx",
            "dato" : "Resiste sequia",
            "imagen" : "https://img.goraymi.com/2024/03/24/74954455ac7cd03f713756dfa7ef557a_xl.jpg"
        }
    },
    {
        "model": "app.Biodiversidad",
        "pk": 4,
        "fields": {
            "nombre_comun" : "Margarita de Galapagos",
            "nombre_cientifico" : "xxxxxxx",
            "dato" : "Evolucion",
            "imagen" : "https://datazone.darwinfoundation.org/images/checklist/dsc05113.jpg"
        }
    },
    {
        "model": "app.Fauna",
        "pk": 1,
        "fields": {
            "biodiversidad_ptr_id" : 1,
            "habitat" : "Bosques secos'",
            "alimentacion" : "Hierbas"
        }
    },
    {
        "model": "app.Fauna",
        "pk": 2,
        "fields": {
            "biodiversidad_ptr_id" : 2,
            "habitat" : "Areas rocosas'",
            "alimentacion" : "Hierbas"
        }
    },
    {
        "model": "app.Flora",
        "pk": 1,
        "fields": {
            "biodiversidad_ptr_id" : 3,
            "distribucion" : "Islas volcanicas'",
            "usos" : "Alimento"
        }
    },
    {
        "model": "app.Flora",
        "pk": 2,
        "fields": {
            "biodiversidad_ptr_id" : 4,
            "distribucion" : "Zonas altas'",
            "usos" : "Estabiliza el suelo"
        }
    },
    {   "model": "app.Ecosistema",
        "pk": 1,
        "fields":
            {
                "nombre": "Manglares",
                "descripcion": "Cada vez más a los manglares se los reconoce como uno de los ecosistemas más productivos en la Tierra, en vista de los múltiples beneficios o servicios ecosistémicos que ellos proveen para las comunidades costeras y para los humanos en general (McNally et al. 2011). Por ejemplo, el 80% de las capturas pesqueras mundiales están directa- o indirectamente vinculadas con los ecosistemas de manglares (Ellison 2008). Los manglares también son desproporcionalmente importantes para el almacenamiento del carbono global a la par que los bosques tropicales más ricos en carbono del mundo (Donato et al. 2011). Y los manglares dan soporte a las industrias turísticas, al brindar oportunidades recreacionales, y al contribuir a la purificación del agua y protección de las costas, lo cual es crucial para el mantenimiento de aguas claras y playas de arena (Lau 2013). En Belice, por ejemplo, investigadores estiman la contribución de los manglares al turismo en más de US$60 millones por año.",
                "imagen": "https://reports.galapagos.org/wp-content/uploads/2022/10/Figure1.jpg"
            }
    },
    {   "model": "app.Ecosistema",
        "pk": 2,
        "fields":
            {
                "nombre": "Playas",
                "descripcion": "Las playas de Galápagos son ecosistemas altamente sensibles y de gran importancia ecológica. Estas áreas costeras no solo son hermosos destinos turísticos, sino que también desempeñan un papel crucial en la preservación de la biodiversidad del archipiélago.Su estratégica ubicación en la confluencia de varias corrientes marinas genera una mezcla de aguas frías y cálidas, lo que ha permitido la llegada y establecimiento de especies de diferentes zonas del océano Pacífico.La reserva es un santuario vital para la vida marina, albergando montes submarinos, afloramientos de nutrientes y una increíble abundancia de plancton.En sus aguas, se pueden observar tiburones martillo, tiburones ballena, mantarrayas, arrecifes de coral y peces de todos los colores.Además, los humedales del sur de la isla Isabela también desempeñan un papel crucial en la biodiversidad de Galápagos, siendo áreas importantes de alimentación y reproducción para especies como el pingüino de Galápagos y la gaviota de lava.",
                "imagen": "http://areasprotegidas.ambiente.gob.ec/sites/default/files/area02-222.jpg"
            }
    },
    {   "model": "app.Ecosistema",
    "pk": 3,
    "fields":
        {
            "nombre": "Bosques Secos",
            "descripcion": "Los bosques secos en las Islas Galápagos son ecosistemas frágiles y de gran valor ecológico. A pesar de su apariencia árida y resistente, estos bosques albergan una diversidad de especies únicas y juegan un papel crucial en el equilibrio ambiental del archipiélago. Mediante este crecimiento lento y debido a la rápida comprensión del importante valor económico, cultural, científico y estético de la biología única de estas islas, en 1959, el 97% de toda la tierra se declaró como protegida bajo el Parque Nacional Galápagos. Aunque cuidadosamente protegidas y limitadas en el contacto humano, estas islas han enfrentado impactos del desarrollo humano y de especies introducidas como cabras y plantas invasoras. La Fundación Charles Darwin (FCD) se dedica a estudiar los ecosistemas de Galápagos para garantizar que podamos hacer todo lo que esté a nuestro alcance para proteger lo que aún está prístino y revertir cualquier daño que ya se haya causado.",
            "imagen": "https://www.darwinfoundation.org/media/images/imagesnews20200611_salvandoPlaya_Tortuga_N.max-1000x1000.jpg"
        }
    },
    {   "model": "app.Ecosistema",
    "pk": 4,
    "fields":
        {
            "nombre": "Bosques de Scalesia",
            "descripcion": "Estos bosques son exclusivos a las Islas Galápagos y forman la zona de Scalesia. El árbol de la margarita es la más grande, y suele llegar a ser hasta 15 metros de alto. Los árboles de la misma especie y la misma edad crecen en parches del bosque, y viven por hasta 25 años. Durante algunos eventos climáticos estresantes, como la sequía o lluvias extremas, todos los árboles de un bosque pueden morir al mismo tiempo, esto se llama ‘muerte regresiva’. Después de esto, plántulas comienzan a germinar en el espacio que antes ocupaban los árboles grandes. Estos bosques son el hogar de fauna espectacular incluyendo la icónica tortuga gigante de Galápagos y muchas especies de aves como la paloma de Galápagos, pinzones de Darwin y papamoscas. Sin embargo, estos bosques están bajo una intensa amenaza de las especies invasoras y la deforestación. Hoy en día, sólo unos pocos parches aislados de bosque permanecen mientras que el resto han sido destruidos.",
            "imagen": "http://blog.discoveringgalapagos.org.uk/wp-content/uploads/2014/11/2.b.-Scalesia-forest-GCT-resize.jpg"
        }
    },
{   "model": "app.Ecosistema",
        "pk": 5,
        "fields":
            {
                "nombre": "Arrecifes de Coral",
                "descripcion": "Los corales son animales que se anclan a rocas donde permanecen inmóviles. Están formados por un esqueleto de carbonato de calcio y producen pigmentos al estar expuestos a la luz solar que es lo que genera esa variedad de colores tan alucinante de los arrecifes. Estos microorganismos  les proveen de nutrientes esenciales gracias al proceso de fotosíntesis que realizan, pero el estrés que provoca el cambio de temperatura y pH del océano en los corales hace que expelen a las algas adheridas. En consecuencia, pierden su color y el acceso a nutrientes que éstas les proveen, con lo cual los corales blanqueados mueren. El cambio climático, innegablemente impacta la biodiversidad del planeta. En el caso de los ecosistemas marinos tropicales, la presencia del fenómeno de El Niño calienta la superficie del océano Pacífico, especialmente en el ecuador y a lo largo de las costas de América del Sur y Central.Por eso, acciones urgentes de mitigación son esenciales.",
                "imagen": "https://iucn.org/sites/default/files/styles/article_image/public/2023-07/whatsapp-image-2023-07-10-at-12.04.44.jpeg?h=7a91d091&itok=pHj7Em1i"
            }
    },
    {   "model": "app.Ecosistema",
        "pk": 6,
        "fields":
            {
                "nombre": "Zonas - Alta Montaña",
                "descripcion": "Las zonas de alta montaña en las Islas Galápagos son ecosistemas sensibles que juegan un papel crucial en la biodiversidad y la regulación climática del archipiélago. Estos hábitats, ubicados en las elevaciones más altas de islas como Isabela y Santa Cruz, albergan especies endémicas que dependen de las condiciones frescas y húmedas para sobrevivir. Las plantas en estas áreas, como las especies de Scalesia, capturan la humedad de la niebla, esencial para el abastecimiento de agua dulce en las islas. Sin embargo, estos ecosistemas enfrentan amenazas significativas, como el cambio climático, que puede alterar los patrones de precipitación y temperatura, y la invasión de especies exóticas que compiten con la flora y fauna nativa. La conservación de estas zonas es vital para mantener el equilibrio ecológico en Galápagos, protegiendo tanto la biodiversidad única como los recursos hídricos de las islas.",
                "imagen": "https://3.bp.blogspot.com/-Qhc-atoEUcE/XIf9lBhgLQI/AAAAAAAAEJE/rQ3memFl-A8WZ2qjQ-2hRlohR0B90nwLACLcBGAs/s1600/ecuador7.jpg"
            }
    },
    {   "model": "app.Ecosistema",
    "pk": 7,
    "fields":
        {
            "nombre": "Humedales",
            "descripcion": "Los humedales en Galápagos son ecosistemas extremadamente sensibles y de gran importancia ecológica. Son refugios vitales para especies endémicas como el flamingo de Galápagos y diversas aves acuáticas, reptiles y plantas adaptadas a condiciones salinas. Sin embargo, los humedales enfrentan varias amenazas, como la contaminación, la alteración del flujo de agua debido a la construcción de infraestructura, y la invasión de especies exóticas que pueden competir con la flora y fauna nativa. El cambio climático también representa un peligro, con el aumento del nivel del mar y la alteración de las precipitaciones que pueden cambiar la dinámica de estos frágiles ecosistemas. La protección de los humedales en Galápagos es crucial para mantener la biodiversidad y los servicios ecosistémicos que brindan, esenciales para la salud ambiental del archipiélago.",
            "imagen": "https://imgs.mongabay.com/wp-content/uploads/sites/25/2017/10/18220753/Humedales-galapagos-isabela-750x512.jpg"
        }
    },
    {   "model": "app.Ecosistema",
    "pk": 8,
    "fields":
        {
            "nombre": "Islotes Rocosos",
            "descripcion": "Los islotes rocosos en Galápagos son ecosistemas altamente sensibles que desempeñan un papel vital en la biodiversidad del archipiélago. Estas formaciones rocosas emergentes son refugios cruciales para aves marinas como piqueros, gaviotas y cormoranes, que los utilizan para anidar y descansar. Además, los islotes ofrecen hábitats para especies endémicas de reptiles y plantas que han adaptado su supervivencia a condiciones extremas de salinidad y escasez de agua. Sin embargo, su fragilidad es evidente ante amenazas como la introducción de especies invasoras, que pueden depredar los huevos y desplazar la fauna nativa. También son vulnerables a la erosión acelerada por el cambio climático y a la presión del turismo no regulado, que puede perturbar los hábitats críticos. La conservación de estos islotes es esencial para proteger las especies que dependen de ellos, así como para mantener el equilibrio ecológico en las Galápagos, asegurando su preservación a largo plazo.",
            "imagen": "https://2.bp.blogspot.com/-Z4ffvEOUZWM/UzRRaJ4b3gI/AAAAAAAAvbQ/2XaozfpDtzo/s1600/rocas+bainbridge+ecuador+galapagos.jpg"
        }
    },
    {
        "model": "app.Calificacion",
        "pk": 1,
        "fields": {
                "isla": 1,
                "usuario": 1,
                "voto": true,
                "puntuacion": 2
        }
    }
    
]